docs(platform): add security rfcs, add security arch proposal for business stakeholders
